package LearningCode3._02常见的数据结构类型;

/**
 * 1.队列
 * 2.栈
 * 3.线性表(数组):内存中连续的区域,大小一样
 *      特点:查询快,增删慢
 * 4.链表
 *      特点:查询慢,增删快
 * 5.红黑树
 *       a.二叉树
 *       b.二叉查找树/二叉排序树
 *           特点:左小右大
 *           缺点:"瘸子现象"
 *       c.平衡二叉树
 *           特点:左右子树高度绝对值不超过1,且左右子树都是平衡二叉树

 *       d.红黑树(特殊的二查找树)
 *           特点:特殊的二叉查找树.红黑树的每一个结点上都有存储位表示结点的颜色,可以是红或者黑
 *                  根节点为黑,叶节点(Nil)为黑
 *                  一个结点为红色,子节点必须为黑色(不存在两个相连的红色结点)
 *                  对每一个结点,从该结点到其所有后代结点的简单路劲上,均包含相同数目的黑色结点
 *                  进行元素插入时,每一次插入完毕,使用黑色规则进行校验,若不满足,就进行变色,左右旋进行调整,使其满足红黑规则
 *
 */
public class DataStructure {
}
